Revit 2026 API

# ConceptualConstructionTypeIsValidSubcategoryForMassSurfaceDatas Method

---

Validate if a subcategory is appropriate for assignment to Massing surfaces (MassSurfaceData). This is the list of acceptable values:

  1. OST_MassInteriorWall
  2. OST_MassExteriorWall
  3. OST_MassExteriorWallUnderground
  4. OST_MassRoof
  5. OST_MassFloor
  6. OST_MassSlab
  7. OST_MassShade
  8. OST_MassGlazing
  9. OST_MassSkylights
  10. OST_MassOpening

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidSubcategoryForMassSurfaceDatas(
	ElementId massSubCategoryId
)
```
```vb
Public Shared Function IsValidSubcategoryForMassSurfaceDatas (
	massSubCategoryId As ElementId
) As Boolean
```
```cpp
public:
static bool IsValidSubcategoryForMassSurfaceDatas(
	ElementId^ massSubCategoryId
)
```
```fsharp
static member IsValidSubcategoryForMassSurfaceDatas :
        massSubCategoryId : ElementId -> bool
```

#### Parameters

massSubCategoryId ElementId
     The mass sub-category to be checked.

#### Return Value

Boolean True if the mass sub-category falls within the list, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This excludes sub-categories which are not actually sub-categories that can be assigned to surfaces, such as OST_MassWallsAll for example.

#### Reference

ConceptualConstructionType Class

Autodesk.Revit.DB.Analysis Namespace